# Pandas

In [517]:
import pandas as pd

In [518]:
data = [i for i in range(10)]

In [519]:
s1 = pd.Series(data)
s1

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [520]:
index = [chr(i) for i in range(97, 107)]
index

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [521]:
s2 = pd.Series(data, index=index)
s2

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [522]:
dict_data = {}

for i in range(10):
    dict_data[index[i]] = data[i]

print(dict_data)

{'a': 0, 'b': 1, 'c': 2, 'd': 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9}

In [523]:
s3 = pd.Series(dict_data)
s3

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int64

In [524]:
population = pd.Series(
    [9776, 2729, 1566, 3158]
    , index=['서울', '부산', '인천', '대구']
    )
print(population['서울'])
print()
print(population[['서울', '부산']])
print()
print(population)

9776

서울    9776
부산    2729
dtype: int64

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [525]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [526]:
s2.iloc[0], s2.loc['a']

(np.int64(0), np.int64(0))

# 데이터 프레임

In [527]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [528]:
# scientists.index = scientists['Name']
# print(scientists)
# print(scientists.loc['William Gosset'])

In [529]:
scientists.to_csv('./data/scientists_1.csv')
scientists.to_csv('./data/scientists_2.csv', index=False)

In [530]:
df = pd.read_csv('./data/scientists_2.csv')

df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [531]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [532]:
# pickle : 파이썬의 객체형을 저장
df1.to_pickle('./data/scientists_pickle.pickle')

In [533]:
df2 = pd.read_pickle('./data/scientists_pickle.pickle')
df2

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

## 행열 추가

In [630]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}

In [631]:
df = pd.DataFrame(data)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      7 non-null      object
 1   나이      7 non-null      int64
 2   점수      7 non-null      int64
dtypes: int64(2), object(1)
memory usage: 300.0+ bytes

In [632]:
# # 행의 이름 변경
# df.index = [chr(i) for i in range(65, 72)]
# df

In [633]:
df1 = df.rename(columns={'이름':'Name', '나이':'Age', '점수':'Score'})
df1

  Name  Age  Score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [634]:
df2 = df1.rename(columns={'Name':'name', 'Age':'age'})
df2

  name  age  Score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [635]:
df.iloc[0]

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [636]:
df.loc[0]

이름    김철수
나이     25
점수     85
Name: 0, dtype: object

In [637]:
print(df)
df[df['나이'] > 26]

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
4  최영호  27  88
6  윤지원  29  91

In [638]:
df[df['점수'] >= 90]

    이름  나이  점수
1  이영희  28  92
3  정수진  31  95
6  윤지원  29  91

In [639]:
df.loc[7] = ['홍길동', 30, 70]
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91
7  홍길동  30  70

In [640]:
# 새로운 행 추가 할 때 iloc 사용 불가

df.iloc[8] = ['김길동', 20, 98]

IndexError: iloc cannot enlarge its target object

In [641]:
df['grade'] = [ 'A' if df.loc[i]['점수'] >= 90 else 'B' if df.loc[i]['점수'] >= 80 else 'C' if df.loc[i]['점수'] >= 70 else 'D' for i in range(len(df))]
# 'A' if df['점수'] >= 90 else 'B' if df['점수'] >= 80 else 'C' if df['점수'] >= 70 else 'D'
df

    이름  나이  점수 grade
0  김철수  25  85     B
1  이영희  28  92     A
2  박민수  22  78     C
3  정수진  31  95     A
4  최영호  27  88     B
5  한미래  24  73     C
6  윤지원  29  91     A
7  홍길동  30  70     C

In [642]:
df

    이름  나이  점수 grade
0  김철수  25  85     B
1  이영희  28  92     A
2  박민수  22  78     C
3  정수진  31  95     A
4  최영호  27  88     B
5  한미래  24  73     C
6  윤지원  29  91     A
7  홍길동  30  70     C

In [643]:
df3 = df.rename(columns={'grade':'등급'})

In [644]:
df3

    이름  나이  점수 등급
0  김철수  25  85  B
1  이영희  28  92  A
2  박민수  22  78  C
3  정수진  31  95  A
4  최영호  27  88  B
5  한미래  24  73  C
6  윤지원  29  91  A
7  홍길동  30  70  C

In [645]:
df3['등급'] = [ 'A' if df3.loc[i]['점수'] >= 90 else 'B' if df3.loc[i]['점수'] >= 80 else 'C' if df3.loc[i]['점수'] >= 70 else 'D' for i in range(len(df))]

In [646]:
df3

    이름  나이  점수 등급
0  김철수  25  85  B
1  이영희  28  92  A
2  박민수  22  78  C
3  정수진  31  95  A
4  최영호  27  88  B
5  한미래  24  73  C
6  윤지원  29  91  A
7  홍길동  30  70  C

In [647]:
df3['등급'] = [ 'A' if df3.loc[i]['점수'] >= 90 else 'B' if df3.loc[i]['점수'] >= 80 else 'C' if df3.loc[i]['점수'] >= 70 else 'D' for i in range(len(df))]

In [648]:
df3.insert(4, 'grade', [ 'A' if df3.loc[i]['점수'] >= 90 else 'B' if df3.loc[i]['점수'] >= 80 else 'C' if df3.loc[i]['점수'] >= 70 else 'D' for i in range(len(df))] )

In [649]:
df3

    이름  나이  점수 등급 grade
0  김철수  25  85  B     B
1  이영희  28  92  A     A
2  박민수  22  78  C     C
3  정수진  31  95  A     A
4  최영호  27  88  B     B
5  한미래  24  73  C     C
6  윤지원  29  91  A     A
7  홍길동  30  70  C     C

In [650]:
df3 = df3.rename(columns={'grade':'등급'})

In [696]:
dates = pd.date_range('2025-01-01', periods=7, freq='W')
print(dates)

DatetimeIndex(['2025-01-05', '2025-01-12', '2025-01-19', '2025-01-26',
               '2025-02-02', '2025-02-09', '2025-02-16'],
              dtype='datetime64[ns]', freq='W-SUN')

In [692]:
monthly_dates = pd.date_range('2025-01-01', periods=12, freq='ME')
print(monthly_dates)

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-31', '2025-06-30', '2025-07-31', '2025-08-31',
               '2025-09-30', '2025-10-31', '2025-11-30', '2025-12-31'],
              dtype='datetime64[ns]', freq='ME')

In [697]:
data

{'이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
 '나이': [25, 28, 22, 31, 27, 24, 29],
 '점수': [85, 92, 78, 95, 88, 73, 91]}

In [698]:
pd.DataFrame(data, index=dates)

             이름  나이  점수
2025-01-05  김철수  25  85
2025-01-12  이영희  28  92
2025-01-19  박민수  22  78
2025-01-26  정수진  31  95
2025-02-02  최영호  27  88
2025-02-09  한미래  24  73
2025-02-16  윤지원  29  91